rottenpotatoes/app/controllers/movies_controller.rb

  def same_director
    id = params[:id]
    @movie = Movie.find(id)
    @current_director = @movie.director
    if @current_director.nil? or @current_director.empty?
      flash[:warning] = "'#{@movie.title}' has no director info."
      redirect_to movies_path
    else
      @movies_to_show = Movie.find_same_director(id)
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "movies".* FROM "movies" WHERE "movies"."director" = ? LIMIT 1  [["director", "George Lucas"]]